MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4NQFDXBG/mcu.h
#define TSB_CANAMB18_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB18->ID,29)))
#define TSB_CANAMB18_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB18->ID,30)))
#define TSB_CANAMB18_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB18->ID,31)))
#define TSB_CANAMB18_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB18->TSVMCF,4)))

#define TSB_CANAMB19_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB19->ID,29)))
#define TSB_CANAMB19_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB19->ID,30)))
#define TSB_CANAMB19_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB19->ID,31)))
#define TSB_CANAMB19_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB19->TSVMCF,4)))

#define TSB_CANAMB20_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB20->ID,29)))
#define TSB_CANAMB20_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB20->ID,30)))
#define TSB_CANAMB20_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB20->ID,31)))
#define TSB_CANAMB20_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB20->TSVMCF,4)))

#define TSB_CANAMB21_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB21->ID,29)))
#define TSB_CANAMB21_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB21->ID,30)))
#define TSB_CANAMB21_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB21->ID,31)))
#define TSB_CANAMB21_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB21->TSVMCF,4)))

#define TSB_CANAMB22_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB22->ID,29)))
#define TSB_CANAMB22_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB22->ID,30)))
#define TSB_CANAMB22_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB22->ID,31)))
#define TSB_CANAMB22_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB22->TSVMCF,4)))

#define TSB_CANAMB23_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB23->ID,29)))
#define TSB_CANAMB23_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB23->ID,30)))
#define TSB_CANAMB23_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB23->ID,31)))
#define TSB_CANAMB23_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB23->TSVMCF,4)))

#define TSB_CANAMB24_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB24->ID,29)))
#define TSB_CANAMB24_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB24->ID,30)))
#define TSB_CANAMB24_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB24->ID,31)))
#define TSB_CANAMB24_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB24->TSVMCF,4)))

#define TSB_CANAMB25_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB25->ID,29)))
#define TSB_CANAMB25_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB25->ID,30)))
#define TSB_CANAMB25_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB25->ID,31)))
#define TSB_CANAMB25_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB25->TSVMCF,4)))

#define TSB_CANAMB26_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB26->ID,29)))
#define TSB_CANAMB26_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB26->ID,30)))
#define TSB_CANAMB26_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB26->ID,31)))
#define TSB_CANAMB26_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB26->TSVMCF,4)))

#define TSB_CANAMB27_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB27->ID,29)))
#define TSB_CANAMB27_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB27->ID,30)))
#define TSB_CANAMB27_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB27->ID,31)))
#define TSB_CANAMB27_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB27->TSVMCF,4)))

#define TSB_CANAMB28_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB28->ID,29)))
#define TSB_CANAMB28_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB28->ID,30)))
#define TSB_CANAMB28_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB28->ID,31)))
#define TSB_CANAMB28_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB28->TSVMCF,4)))

#define TSB_CANAMB29_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB29->ID,29)))
#define TSB_CANAMB29_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB29->ID,30)))
#define TSB_CANAMB29_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB29->ID,31)))
#define TSB_CANAMB29_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB29->TSVMCF,4)))

#define TSB_CANAMB30_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB30->ID,29)))
#define TSB_CANAMB30_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB30->ID,30)))
#define TSB_CANAMB30_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB30->ID,31)))
#define TSB_CANAMB30_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB30->TSVMCF,4)))

#define TSB_CANAMB31_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB31->ID,29)))
#define TSB_CANAMB31_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB31->ID,30)))
#define TSB_CANAMB31_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB31->ID,31)))
#define TSB_CANAMB31_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB31->TSVMCF,4)))


/* CAN Controller Mailbox RAM (CANMB) */
#define TSB_CANBMB0_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB0->ID,29)))
#define TSB_CANBMB0_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB0->ID,30)))
#define TSB_CANBMB0_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB0->ID,31)))
#define TSB_CANBMB0_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB0->TSVMCF,4)))

#define TSB_CANBMB1_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB1->ID,29)))
#define TSB_CANBMB1_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB1->ID,30)))
#define TSB_CANBMB1_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB1->ID,31)))
#define TSB_CANBMB1_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB1->TSVMCF,4)))

#define TSB_CANBMB2_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB2->ID,29)))
#define TSB_CANBMB2_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB2->ID,30)))
#define TSB_CANBMB2_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB2->ID,31)))
#define TSB_CANBMB2_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB2->TSVMCF,4)))

#define TSB_CANBMB3_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB3->ID,29)))
#define TSB_CANBMB3_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB3->ID,30)))
#define TSB_CANBMB3_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB3->ID,31)))
#define TSB_CANBMB3_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB3->TSVMCF,4)))

#define TSB_CANBMB4_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB4->ID,29)))
#define TSB_CANBMB4_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB4->ID,30)))
#define TSB_CANBMB4_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB4->ID,31)))
#define TSB_CANBMB4_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB4->TSVMCF,4)))

#define TSB_CANBMB5_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB5->ID,29)))
#define TSB_CANBMB5_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB5->ID,30)))
#define TSB_CANBMB5_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB5->ID,31)))
#define TSB_CANBMB5_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB5->TSVMCF,4)))

#define TSB_CANBMB6_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB6->ID,29)))
#define TSB_CANBMB6_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB6->ID,30)))
#define TSB_CANBMB6_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB6->ID,31)))
#define TSB_CANBMB6_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB6->TSVMCF,4)))

#define TSB_CANBMB7_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB7->ID,29)))
#define TSB_CANBMB7_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB7->ID,30)))
#define TSB_CANBMB7_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB7->ID,31)))
#define TSB_CANBMB7_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB7->TSVMCF,4)))

#define TSB_CANBMB8_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB8->ID,29)))
#define TSB_CANBMB8_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB8->ID,30)))
#define TSB_CANBMB8_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB8->ID,31)))
#define TSB_CANBMB8_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB8->TSVMCF,4)))

#define TSB_CANBMB9_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB9->ID,29)))
#define TSB_CANBMB9_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB9->ID,30)))
#define TSB_CANBMB9_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB9->ID,31)))
#define TSB_CANBMB9_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB9->TSVMCF,4)))

